trailcurrentoss/TrailCurrentMilepost/sdkconfig.defaults
# Target: ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Flash (16MB, QIO 120MHz — must match PSRAM speed. Reverting to 80MHz
# starved the RGB LCD DMA of bandwidth and caused the whole-screen
# cycling vertical shift to appear IMMEDIATELY rather than after hours
# of uptime. The 120MHz combined config is IDF-experimental but has
# been the working configuration for this board.)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_120M=y

# PSRAM (8MB OPI, 120MHz — matches flash. Tried 80MHz per plan Step 4
# but immediate DMA underrun made the display shift-cycle instantly
# instead of after hours. Empirically 120MHz gives the RGB DMA enough
# bandwidth headroom to keep the panel stable; the slow-onset artifacts
# the plan attributed to 120MHz PSRAM corruption are almost certainly
# a different mechanism.)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM_SPEED_120M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

# Compiler optimization
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# TWAI (CAN bus)
CONFIG_TWAI_ERRATA_FIX_RX_FRAME_INVALID=y
CONFIG_TWAI_ERRATA_FIX_RX_FIFO_CORRUPT=y
# Place the TWAI ISR in IRAM so it isn't stalled by cache misses while
# the RGB panel / GDMA is hammering PSRAM. Requires g_config.intr_flags
# to include ESP_INTR_FLAG_IRAM at driver install (see can_init()).
CONFIG_TWAI_ISR_IN_IRAM=y

# Latency hardening for the RGB LCD + GDMA path.
# The RGB panel + GDMA bounce-buffer refill ISRs run on the core that
# installs them (core 0 here). Under heavy CAN traffic that same core
# is servicing the TWAI ISR too. IRAM-safe ISRs keep firing even when
# the flash cache is disabled (e.g. NVS writes); RESTART_IN_VSYNC lets
# the panel self-heal after an underrun instead of latching a black
# frame / shifted image until the next power cycle.
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y
CONFIG_LCD_RGB_RESTART_IN_VSYNC=y
CONFIG_GDMA_ISR_IRAM_SAFE=y

# OTA rollback protection
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# Task WDT panics instead of just logging. If the main (LVGL) task or
# any other WDT-subscribed task hangs for CONFIG_ESP_TASK_WDT_TIMEOUT_S
# (5s), we want a panic + reboot rather than silently limping.
CONFIG_ESP_TASK_WDT_PANIC=y

# Coredump to UART — the panic dumps base64-encoded coredump to the
# same serial console as the panic backtrace, so it's captured
# whenever the user is monitoring. Chose UART over FLASH because the
# 16MB partition table is already fully allocated (16MB app A/B +
# nvs) and shrinking the OTA slots would break in-flight OTA-deployed
# devices' partition-table expectations.
CONFIG_ESP_COREDUMP_ENABLE_TO_UART=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y

# HTTP server for OTA uploads
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# LVGL color settings
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_COLOR_16_SWAP=n

# LVGL memory — use stdlib malloc (PSRAM-aware)
CONFIG_LV_MEM_CUSTOM=y
CONFIG_LV_MEMCPY_MEMSET_STD=y
CONFIG_LV_ATTRIBUTE_FAST_MEM=y
# Route hot renderer functions (blend / span / mask) into IRAM. Vendor
# reference config for this board. Without this they live in flash/PSRAM
# and cache misses show up as sub-100us stalls that align with visible
# scan-position slips.
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y

# LVGL HAL
CONFIG_LV_DISP_DEF_REFR_PERIOD=33
CONFIG_LV_INDEV_DEF_READ_PERIOD=15
CONFIG_LV_DPI_DEF=130

# LVGL drawing
CONFIG_LV_DRAW_COMPLEX=y

# LVGL logging
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y

# LVGL fonts
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# LVGL widgets
CONFIG_LV_USE_ARC=y
CONFIG_LV_USE_BAR=y
CONFIG_LV_USE_BTN=y
CONFIG_LV_USE_BTNMATRIX=y
CONFIG_LV_USE_CHECKBOX=y
CONFIG_LV_USE_DROPDOWN=y
CONFIG_LV_USE_IMG=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_LINE=y
CONFIG_LV_USE_ROLLER=y
CONFIG_LV_USE_SLIDER=y
CONFIG_LV_USE_SWITCH=y
CONFIG_LV_USE_TEXTAREA=y
CONFIG_LV_USE_TABLE=y

# LVGL extra widgets
CONFIG_LV_USE_KEYBOARD=y
CONFIG_LV_USE_LED=y
CONFIG_LV_USE_LIST=y
CONFIG_LV_USE_METER=y
CONFIG_LV_USE_MSGBOX=y
CONFIG_LV_USE_SPINNER=y
CONFIG_LV_USE_TABVIEW=y

# LVGL themes
CONFIG_LV_USE_THEME_DEFAULT=y
CONFIG_LV_THEME_DEFAULT_DARK=n
CONFIG_LV_USE_THEME_BASIC=y

# LVGL layouts
CONFIG_LV_USE_FLEX=y
CONFIG_LV_USE_GRID=y

# LVGL perf/debug
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n
